app/controllers/api/boards_controller.rb

  def create
    @board = Board.new(board_params)
    @board.creator_id = current_user.id
    if @board.save
---
INSERT INTO "boards" ("title", "description", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TEST"], ["description", ""], ["creator_id", 130], ["created_at", "2020-05-26 23:15:23.659059"], ["updated_at", "2020-05-26 23:15:23.659059"]]

  def index
    # needs to be the all boards of certain user
    # @boards = @user.boards
    @boards = Board.all
---
SELECT "boards".* FROM "boards"

  def update
    @board = Board.find(params[:id])
    if (@board.creator_id === current_user.id && @board.update(board_params))
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 221], ["LIMIT", 1]]
UPDATE "boards" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "boards"."id" = $4  [["title", "texturesa"], ["description", "aSD"], ["updated_at", "2020-05-26 23:15:00.150443"], ["id", 221]]