app/controllers/api/pins_controller.rb

  def create
    @pin = Pin.new(pin_params)
    debugger
    @pin.creator_id = current_user.id
    if @pin.save
---
INSERT INTO "pins" ("title", "description", "creator_id", "created_at", "updated_at", "board_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "as"], ["description", ""], ["creator_id", 130], ["created_at", "2020-05-26 23:14:43.294211"], ["updated_at", "2020-05-26 23:14:43.294211"], ["board_id", 221]]

  def update
    @pin = Pin.find(params[:id])
    if (@pin.creator_id === current_user.id && @pin.update(pin_params))
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 718], ["LIMIT", 1]]
UPDATE "pins" SET "board_id" = $1, "updated_at" = $2 WHERE "pins"."id" = $3  [["board_id", 217], ["updated_at", "2020-05-27 03:56:09.908511"], ["id", 718]]

  def destroy
    @pin = Pin.find(params[:id])
    @pin.destroy
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 744], ["LIMIT", 1]]
DELETE FROM "pins" WHERE "pins"."id" = $1  [["id", 744]]