app/views/api/users/_user.json.jbuilder

SELECT "pins".* FROM "pins" WHERE "pins"."board_id" = $1  [["board_id", 191]]
---
    json.extract! board, :id, :title, :description, :creator_id
    json.pins board.pins.each do |pin|