app/views/api/boards/_board.json.jbuilder

json.extract! board, :id, :title, :description, :creator_id
json.pins board.pins.each do |pin|
---
SELECT "pins".* FROM "pins" WHERE "pins"."board_id" = $1  [["board_id", 191]]