app/models/user.rb

  def reset_session_token!
    self.update!(session_token: User.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "KJFMXsGRtry6xUPswTR0jw"], ["updated_at", "2020-05-26 23:02:38.042674"], ["id", 126]]